
/**
 * Перечисление всех возможных значений версий карты
 */
export enum EMapVersionValues {
    "1.21.0.7" = "1.21.0.7",
    "1.21.0.8" = "1.21.0.8",
    "1.21.1.1" = "1.21.1.1",
    "1.21.1.2" = "1.21.1.2",
    "1.21.1.3" = "1.21.1.3",
    "1.21.1.4" = "1.21.1.4",
    "1.21.2.1" = "1.21.2.1",
    "1.21.2.100" = "1.21.2.100",
}

/**
 * Запись версии карты в бд
 */
export interface IMapVersionRecord {
    // id в монго
    _id: string;
    // Значение карты, передаваемое из игры
    value: EMapVersionValues;
}